---------------------------------------------------------------------->
-- 脚本名称:	scripts/skill/include/21年10月新boss伤害data.lua
-- 更新时间:	2021/11/6 16:08:40
-- 更新用户:	qinfupi
-- 脚本说明:	
----------------------------------------------------------------------<
local nScale = 1.5 --2021年10月28号的伤害系数，后面赛季调伤害调这个系数就行

--数值维护需要配套维护的buff值
--【1】boss脱战的盾量：26497，2023.6月版本是2000万盾

--技能伤害写到这里汇总吧，方便赛季交替更新数值
local tPugong = {--标准普攻伤害，一二三档，无特许需求可以蹭这里
	[1] = 132000 * nScale,
	[2] = 153600 * nScale,
	[3] = 184500 * nScale,
}

--技能伤害需要把无极·怒的50%伤害加成算进去！！
tGFBossSkillDamage = {
	Carrier = {
		bomb = 362500, --指挥车火弹（轰炸）
		stone = 333300, --投石车
		fire = 145000, --指挥车燃火箭
	},
	All = {						--通用的普攻伤害，懒得自己写普攻技能可以蹭这个技能28993
		atk = tPugong[1], --普攻		
	},
	MuXuanYing = {	--穆玄英
		atk = tPugong[2], --普攻
		lyj = 176000 * nScale, --龙影剑
		lyj_sp = 264000 * nScale, --龙影剑·强化
		jianyi = 58600 * nScale, --剑意
		jianyi_sp = 64500 * nScale, --剑意·强化
	},
	ZhaoZiEr = {	--赵紫儿
		atk = tPugong[1], --普攻
		dyl = 172100* nScale,			--断雨帘
		sly = 86000* nScale,			--散涟漪
		sly_dot = 63100* nScale,		--散涟漪·后续AOE
	},
	YiYe = {	--伊夜
		atk = 50000 * nScale,			--扇形特殊群攻普攻，主目标额外附带30%最大气血值伤害
		ltl = 88000* nScale,			--乱天狼每次
		zwc = 108500* nScale,			--斩无常
		yb = 114000* nScale,			--影豹突袭
	},
	YueLang = {  	--岳琅
		atk = tPugong[1],			--普攻
		jchd = 150000* nScale,			--巨锤撼地
		hdqk = 150000* nScale,			--晃动乾坤
		lpfw = 172100* nScale,		    --乱披风舞
	},
	BaiMou = {  	--白某
		atk = tPugong[2],			--普攻
		tjyj = 150000* nScale,			--天机衍尽
		bftm = 150000* nScale,			--毕方燎原·退魔天机
		ssrs = 50000* nScale,		    --上善若水
		fz = 20000* nScale,		       --符·震
	},
	BiLuoBa = {  	--毕罗巴
		atk = tPugong[1],			--普攻
		shz = 163500* nScale,			--圣火灼
		lhy = 80000* nScale,			--烈火印
		bhz = 80000* nScale,		    --拜火斩
		xhl = 120000* nScale,		    --旋火轮
		lhycl = 54500* nScale,         --烈火印残留
		yhc = 40000* nScale,           --业火刺
		--zhs = 30000,           --震火势
	},
	GuoZhu= {  	--郭珠
		atk = tPugong[1],			--普攻
		klyh = 167000* nScale,			--亢龙有悔
		jxj = 80000* nScale,			--祭湘君
		jxjzq = 80000* nScale,		    --祭湘君竹圈
		clxs = 120000* nScale,		    --乘龙戏水
		clkl = 50000* nScale,         --乘龙戏水大亢龙
	},
	SiTuYiYi = {  	--司徒一一
		atk = 50000* nScale,		--普攻，主目标附带25%最大气血值伤害
		mrxz = 50000* nScale,			--木人旋转
		qlth = 50000* nScale,			--麒麟吐火
		jyrc = 150000* nScale,		    --箭雨
	},
	HanFeiChi = {  	--韩非池
		atk = 50000* nScale,		--环形特殊aoe普攻，主目标附带30%最大气血值伤害
		qy = 220000* nScale,		    	--强音
		ybks = 70000* nScale,			--音波扩散每秒一次，一共5次
		ybbz = 132000* nScale,		    --音波爆炸
		ybq = 15000* nScale,           --音波球？
	},
	YeJingChi = {  	--叶镜池
		atk = tPugong[1],			--普攻
		jxmy = 100000* nScale,			--九溪弥烟
		yfyh = 150000* nScale,			--云飞玉皇
		flws1 = 180000* nScale,	    --风来吴山
		flws2 = 80000* nScale,         --风来吴山风场
	},
	XiaoQi = {  	--小七
		atk = tPugong[2],		--普攻
		zxlr = 65000* nScale,			--珠袖落日
		ycds = 100000* nScale,			--月出东山
		mdsf1 = 150000* nScale,	    --名动四方
		mdsf2 = 80000* nScale,         --名动四方子技能
		jwsl = 50000* nScale,          --剑舞生莲
	},
	DingDing = {  	--丁丁
		atk = tPugong[1],			--普攻
		xyss = 160000* nScale,			--雪月死生
		fckp = 140000* nScale,			--凡尘看破aoe
		fckp_Dot = 50000* nScale,	    --凡尘看破引导持续伤害,持续5次
	},
	DuGuXiu = {  	--独孤修
		atk = tPugong[2],			--普攻
		hqzl = 100000* nScale,			--黄泉浊浪
		hqhym = 80000* nScale,			--黄泉幻影·灭
		cfql = 150000* nScale,	       --长风秋露
	},
	Yan = {  	--烟
		--atk = 80000,			--普攻,蹭技能	28993
		yz = 191300* nScale,			--[烟_回燕剑·燕斩]:1346,CD帧480，115200
		jl = 48800* nScale,			--[烟_飞燕剑·惊龙]:1347,CD帧720
		--wxz = 80000,			--[烟_三笑问心针]:1348,CD帧480,绑定buff伤害1470
	},
	SiKong = {  	--司空仲平
		--atk = 80000,			--普攻,蹭技能	28993
		bwxj = 317400* nScale,			--[司空仲平_霸王卸甲]:1352,CD帧160，115200
		--kb = 48800,			--[司空仲平_狂暴]::1354,CD帧480,绑定buff增益1475
		xlg = 143400* nScale,			--[司空仲平_降龙棍]:1353,CD帧480
	},
	YueNongHen = {  	--月弄痕
		--atk = 80000,			--普攻,蹭技能	28993
		--bq = 317400,			--[月弄痕_霸气]:1361,CD帧960，115200,绑定buff增益1480
		rdhy = 191300* nScale,			--[月弄痕_人刀合一]:1362,CD帧480,绑定buff增益1475
		htmd = 119500* nScale,			--[月弄痕_毁天灭地]:1363,CD帧320
	},
	ZhangZhiYuan = {  	--张桎辕
		--atk = 80000,			--普攻,蹭技能	28993
		sxlh = 356100 * nScale, --[张桎辕_四象轮回]:1349,CD帧160，115200 张桎辕打当前目标使用1349技能，然后溅射旁边的4个目标打21139 技能
		jssh = 191300 * nScale,
		--bgdx = 191300,		--[张桎辕_八卦洞玄]:1350,CD帧480,附加buff1473
		lhdz = 47800* nScale,			--[张桎辕_六合独尊子技能]:1369,CD帧320
	},
	Ying = {  	--影
		--atk = 80000,			--普攻,蹭技能	28993
		--jhyl = 516100,		--[影_惊鸿游龙]:18863,CD帧960，115200,buff12705
		bylhz = 71700* nScale,			--[影_暴雨梨花针]:1359,CD帧240
		yan = 16700* nScale,			--[影_烟]:1360,CD560,召唤npc59129释放18861技能，造成真实伤害
	},
	XieYuan = {  	--谢渊
		atk = 50000* nScale,			--[谢渊_普通攻击]:7328,范围伤害，且对主T附加最大气血值30%的真实伤害
		zhj = 40000* nScale,			--[谢渊_齑裂·战魂劫]:7329,普攻根据对方招架值附带的战魂劫伤害，lv1为0，之后每级递增，最多4级3倍伤害
		zbf = 189300* nScale,			--[谢渊_战八方]:7234,CD12，115200
		cy = 143400* nScale,			--[谢渊_沧月]:7233,CD12
		--srs = 16700,			--[龙门_守如山]:7180,CD960,半血释放		
		--blly = 16700,			--[谢渊_碧落龙吟]:7180,CD960,
	},
	XiaoYaoEr = {  	--肖药儿
		--atk = 80000,			--普攻,蹭技能	28993
		nxw= 3300000* nScale,			--[肖药儿_凝血丸·仙品]:1343,CD帧320，115200,治疗量
		--xxsz = 71700,		--[肖药儿_星宿神掌·虚]:1344,CD帧320,绑定buff1468伤害
		dwz = 71700* nScale,			--[肖药儿_毒王杖·爆]:1345,CD帧720，顺便绑定1490buff
	},
	MiLiGuLi = {  	--米丽古丽
		--atk = 80000,			--普攻,蹭技能	28993
		--sf= 3300000,			--[米丽古丽_烈日剑·升凤]:1331,CD帧160，115200,buff1452
		ys = 119500* nScale,			--[米丽古丽_圣火剑·玉碎]:1332,CD帧240
		zx = 387000* nScale,			--[米丽古丽_夺心手·摘心]:1333,CD帧352
	},
	TaoHanTing = {  	--陶寒亭
		--atk = 80000,			--普攻,蹭技能	28993
		--yl= 3300000,			--[陶寒亭_殁蝶刀·月落]:1318,CD帧160，115200，buff1489
		xc = 143400* nScale,			--[陶寒亭_殁蝶刀·星沉]:1323,CD帧400
		--qs = 387000,			--[陶寒亭_殁蝶刀·秋水]:1324,CD帧960，buff1453
	},
	WangYiFeng = {  	--王遗风
		atk = 50000* nScale,			--[恶人谷_王遗风_普通攻击]:7231，且对主T附加最大气血值30%的真实伤害
		zhj = 40000* nScale,			--[恶人谷_王遗风_齑裂·红尘劫]:7327,普攻根据对方招架值附带的战魂劫伤害，lv1为0，之后每级递增，最多4级3倍伤害
		zy = 189300* nScale,			--[恶人谷_王遗风_红尘曲·葬月]:7229,CD12，115200，buff1374
		qc = 143400* nScale,			--[恶人谷_王遗风_红尘曲·倾城]:7230,CD12
		--xm = 16700,			--[恶人谷_王遗风_红尘曲·心魔]:7228,CD帧240,buff1373
		--ys = 16700,			--[恶人谷_王遗风_红尘曲·御伤]:7330,CD960,半血释放,buff2213
	},
	YouJu = {  	       --游驹
		atk = tPugong[1],			--普攻
		hfpy = 80000* nScale,			--含锋破月
		fymj = 120000* nScale,			--飞叶满襟
		qdsx = 60000* nScale,		    --且待时休
	},
}